mdhardenburgh/Blinky/Packages/.cache/NXP.MKL33Z644_DFP.12.0.0.pdsc
    <condition id="device.MKL33Z644_AND_driver.common_AND_driver.lpuart">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MKL33Z644_AND_component.lists_AND_driver.common">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="driver.lpuart_OR_driver.uart">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.lpuart_OR_driver.uart">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require condition="driver.lpuart_OR_driver.uart"/>
    </condition>
    <condition id="device.MKL33Z644_AND_CMSIS_Include_core_cm0plus">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.MKL33Z644_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.i2c_dma">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKL33Z644_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.lpuart_dma">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKL33Z644_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.spi_dma">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.2.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKL33Z644_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.uart_dma">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_dma"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="device.MKL33Z644_AND_device.MKL33Z644_CMSIS_AND_driver.clock">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKL33Z644_startup"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.common_AND_driver.dmamux">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.flexio">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.flexio_i2s">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.flexio_spi">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.flexio_uart">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.i2c">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.lpuart">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.spi">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL33Z644_AND_driver.dma_AND_driver.uart">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.MKL33Z644_AND_utility.debug_console">
      <accept Dname="MKL33Z64???4*" Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32???4*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
